rost0031/STM32491_CPLR/Firmware/Application/src/app/CommMgr.c
/*****************************************************************************
* Model: CommMgr.qm
* File:  ./CommMgr_gen.c
*
* This code has been generated by QM tool (see state-machine.com/qm).
* DO NOT EDIT THIS FILE MANUALLY. All your changes will be lost.
*
* This program is open source software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published
* by the Free Software Foundation.
*
* This program is distributed in the hope that it will be useful, but
* WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
* or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
* for more details.
*****************************************************************************/
/*${.::CommMgr_gen.c} ......................................................*/
/**
 * @file    CommMgr.c
 * Declarations for functions for the CommMgr AO.  This state
 * machine handles all incoming messages and their distribution for the
 * bootloader.
 *
 * Note: If editing this file, please make sure to update the CommMgr.qm
 * model.  The generated code from that model should be very similar to the
 * code in this file.
 *
 * @date    05/27/2014
 * @author  Harry Rostovtsev
 * @email   harry_rostovtsev@datacard.com
 * Copyright (C) 2014 Datacard. All rights reserved.
 *
 * @addtogroup groupComm
 * @{
 */

/* Includes ------------------------------------------------------------------*/
#include "CommMgr.h"
#include "project_includes.h"           /* Includes common to entire project. */
#include "bsp.h"                              /* For time to ticks conversion */
#include "I2C1DevMgr.h"                                  /* For I2C Evt types */
#include "time.h"
#include "stm32f4x7_eth.h"
#include "serial.h"                               /* For serial functionality */
#include "LWIPMgr.h"                        /* For UDP ethernet functionality */
#include "base64_wrapper.h"                            /* For base64 encoding */
#include "SerialMgr.h"
#include "LWIPMgr.h"
#include "SysMgr.h"
#include "version.h"

/* Compile-time called macros ------------------------------------------------*/
Q_DEFINE_THIS_FILE;                 /* For QSPY to know the name of this file */
DBG_DEFINE_THIS_MODULE( DC3_DBG_MODL_COMM );/* For debug system to ID this module */

/* Private typedefs ----------------------------------------------------------*/

/**
 * \brief CommMgr "class"
 */
/*${AOs::CommMgr} ..........................................................*/
typedef struct {
/* protected: */
    QActive super;

    /**< Local buffer to store incoming msgs */
    uint8_t* dataBuf[DC3_MAX_MSG_LEN];

    /**< Common struct for DC3BasicMsg.  This can be re-used in most cases since once the
     * request has been unwrapped, all the data from that struct has been stored locally */
    struct DC3BasicMsg basicMsg;

    /**< Keeps track of how far into the dataBuf basicMsg was.  Sometimes, there are
     * additional payload msgs after the BasicMsg in the buffer and this variable allows
     * the next deserialization step to know where to find them */
    uint16_t basicMsgOffset;

    /**< Keeps track of where the message came from */
    DC3MsgRoute_t msgRoute;

    /**< Keep track of the ID of the msg */
    uint32_t msgId;

    /**< Keep track of whether Prog responses were requested by the sender of the msg */
    bool msgReqProg;

    /**< Keep track of the CLI_RECEIVED_SIG event source in order to send it back the
     * same comm channel */
    DC3MsgRoute_t cliEvtSrc;

    /**< Keep track of the CLI_RECEIVED_SIG event destination.
     * TODO: This isn't currently used but hold on to it just in case. Figure out if
     * this is even needed.*/
    DC3MsgRoute_t cliEvtDst;

    /**< Keep track of errors that may occur in the AO */
    DC3Error_t errorCode;

    /**< Keep track of what the payload msg is supposed to be upon reception.  This is
     * necessary because basicMsg struct gets modified to send an Ack and this variable
     * will be used to extract the rest of the payload from the data buffer where it's
     * still being stored. */
    DC3MsgName_t msgPayloadName;

    /**< Union of all the possible payload msgs.  This gets populated by the recieved msg
     * processing and later reused to send Prog and Done msgs. */
    DC3PayloadMsgUnion_t payloadMsgUnion;

    /**< Timer for timing out the Busy state of CommMgr Ao. */
    QTimeEvt commMgrTimerEvt;

    /**< Timer for timing out the individual operations in CommMgr AO. */
    QTimeEvt commOpTimerEvt;
} CommMgr;

/* protected: */
static QState CommMgr_initial(CommMgr * const me, QEvt const * const e);

/**
 * This state is a catch-all Active state.  If any signals need
 * to be handled that do not cause state transitions and are
 * common to the entire AO, they should be handled here.
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
static QState CommMgr_Active(CommMgr * const me, QEvt const * const e);

/**
 * @brief	Idle state that allows new messages to be received.
 * The Idle state allows for handling of new incoming msgs. Msgs in other states
 * will be either deferred or ignored.
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
static QState CommMgr_Idle(CommMgr * const me, QEvt const * const e);

/**
 * @brief	Busy state for msg processing.
 * This state handles msg processing and indicates that the system is busy and
 * cannot process another msg at this time.
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
static QState CommMgr_Busy(CommMgr * const me, QEvt const * const e);

/**
 * @brief	State that ensures the system stays in the Busy state while processing.
 * This state just self-posts an event to start the msg processing. Its primary
 * reason for existance is to make sure that the state machine ends up inside the
 * busy state for proper error handling (if any occur).
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
static QState CommMgr_ValidateMsg(CommMgr * const me, QEvt const * const e);


/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables and Local objects ---------------------------------------*/

